{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "batch_input_shape": [null, 11, 1], "input_dtype": "float32", "return_sequences": false, "go_backwards": false, "stateful": false, "unroll": false, "consume_less": "cpu", "input_dim": 1, "input_length": null, "output_dim": 1, "init": "glorot_uniform", "inner_init": "orthogonal", "forget_bias_init": "one", "activation": "tanh", "inner_activation": "hard_sigmoid", "W_regularizer": null, "U_regularizer": null, "b_regularizer": null, "dropout_W": 0.0, "dropout_U": 0.0}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "output_dim": 1, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 1}}], "keras_version": "1.2.0"}
